---
kind: other
id: Properties.T:Autodesk.Revit.DB.IntersectionResultArray
source: html/4dafe3af-06d4-cab6-3bde-4f1910b9c5f6.htm
---
# IntersectionResultArray Properties

Test to see if the array is empty.